[
    {
      "recipeName": "Aloo Paratha",
      "addedBy":"Ishita",
      "ingredients":"250 gm whole wheat, flour, Pinch of salt, 1 cup water, 50 ml oil For the filling, 500 gm potatoes, 20 gm coriander leaves, 20 gm ginger garlic paste, 75 gm onions, 5 gm green chillies, 5 gm turmeric, 5 gm chilli powder, 10 ml lime juice, Oil for frying",
        "recipe":"1. Make a soft dough with the specified ingredients.                                                   2. Divide the dough into balls, as per the required size.                                              3. Chop the onions, green chillies and the coriander leaves. Then boil the potatoes;                      remove the skin and mash.                                                                           4. Add the rest of the ingredients and mix well. Take each portion of the dough,                          flatten it on palm.                                                                                 5. Stuff the filling in the dough and roll into balls. With a rolling pin, flatten                        the balls into 1/2\" thick round parathas.                                                          6. Grease a pan with a little oil and heat on a medium flame.                                          7. Cook the parathas until both sides are golden and cooked through.",
        "duration":"20 minutes"
    },
    {
        "recipeName": "Dal Makhani",
        "addedBy":"Nibhya",
        "ingredients": "Whole black gram (sabut urad), 1/2 cup Red kidney beans (rajma), 2 tablespoons  Red chilli powder,Salt to taste, 1 teaspoon Ginger, grated or chopped 2 inch piece Butter, 3 tablespoons Oil 1 tablespoon Cumin seeds 1 teaspoon Garlic cloves chopped 6 Onion chopped 1 large Green chillies, slit 2 Tomatoes chopped, 3 medium Garam masala powder 1 teaspoon",
        "recipe":"Step 1                                                                                                       Pick, wash and soak sabut urad and rajma overnight in three cups of water. Drain.                                                                                              Step 2                                                                                                       Pressure cook sabut urad and rajma in three cups of water with salt and half the red chilli powder (you can add half the ginger too if you wish) for three whistles in a pressure cooker. Open the lid and see if the rajma is totally soft. If not cook on low heat till the rajma becomes totally soft. Step 3                                                                                                        Heat butter and oil in a pan. Add cumin seeds. When they begin to change colour, add ginger, garlic and onion and sauté till golden.                                                              Step 4                                                                                                         Add slit green chillies, tomatoes and sauté on high heat. Add the remaining red chilli powder and sauté till the tomatoes are reduced to a pulp.                                                     Step 5                                                                                                         Add the cooked dal and rajma along with the cooking liquour. Add some water if the mixture is too thick. Add garam masala powder and adjust salt.                                                    Step 6                                                                                                         Simmer on low heat till the dals are totally soft and well blended.                            Step 7                                                                                                         Serve hot.",
        "duration": "40 minutes"
    }
]